IDEA Open Model
ApplyConnTemplateSetting Properties
Compatible with IDEA StatiCa 20.1
The ApplyConnTemplateSetting type exposes the following members.
Properties
Name | Description
DefaultBoltAssemblyID
 ID of the bolt assembly which will be used as default (it must exists in the project)
DefaultCleatCrossSectionID
 ID of the cross section for cleats which will be used as default (it must exists in the project)
DefaultConcreteMaterialID
 ID of the material concrete which will be used as default (it must exists in the project)
DefaultStiffMemberCrossSectionID
 ID of the cross-section for stiffening members concrete which will be used as default (it must exists in the project)
Top
See Also
Reference
ApplyConnTemplateSetting Class
IdeaRS.OpenModel.Connection Namespace